var useStatus = [["0", "无效"], ["1", "有效"]];
//有效状态
var yesno = [["0", "否"], ["1", "是"]];
//是否
var orgType = [["90", "子公司"], ["0", "分公司"], ["1", "部门"], ["10", "科室"], ["3", "A类分公司"], ["4", "B类分公司"], ["6", "省内独立合伙人"], ["5", "省外独立合伙人"], ["99", "外部合作组织"]];
//组织架构类型
var sex = [["0", "女"], ["1", "男"]];
//性别
var dataFrom = [["1", "自动上传"], ["2", "excel导入"], ["3", "手动录入"], ["4", "地图打卡"], ["5", "微信打卡"], ["6", "微信补卡"]];
//数据来源
var onoff = [["0", "关"], ["1", "开"]];
//开关
var education = [["40", "硕士及以上"], ["60", "本科"], ["70", "专科"], ["80", "专科以下"]];
//学历
var flowtype = [["1", "自由流程"], ["2", "固定流程"]];
//流程类型
var billtype = [["0", "普通发票"], ["1", "增值税专用发票"], ["2", "电子普票"], ["3", "电子专票"]];
//发票种类
var projectType = [["3", "房建"], ["2", "非房建"]];
//项目类型
var borrowtype = [["0", "现金"], ["1", "银行转账"], ["2", "转到工资卡"]];
//借款/报销方式
var consultType = [["0", "结算审核及预算审核效益费"], ["1", "工程量清单及预算：编制、审核、评审"], ["2", "司法鉴定"], ["3", "清标、评标"], ["4", "全过程项目"], ["5", "其它"], ["6", "估算、设计概算"], ["7", "管理审计、尽职调查"], ["8", "信息咨询"], ["9", "非全过程"]];
//咨询类型
var specialtyDetailType = [["0", "土建"], ["1", "安装"], ["2", "一类"], ["3", "二类"], ["4", "三类"], ["5", "通用"]];
//专业明细类型
var expenseitem = [["1", "飞机票"], ["2", "火车票"], ["3", "公共汽车票"], ["4", "出租车票"], ["5", "公交车"], ["6", "船票"], ["7", "住宿票"], ["8", "出差补助"], ["9", "过路费"], ["10", "停车费"], ["11", "洗车费"], ["12", "燃油费"], ["13", "车辆保险"], ["14", "车辆维修"]];
//差旅报销项目
var workrunstatus = [["1", "审批中"], ["2", "完成"], ["3", "不需审批 "], ["4", "退回发起人"], ["5", "退回上一步"], ["7", "流程终止"]];
//流程状态
var mobilizationtype = [["1", "总部跨部门调动"], ["2", "总部与分公司之间调动"], ["3", "分公司与分公司之间调动"], ["4", "分公司跨部门调动"], ["5", "其他"]];
//调动类型
var allocationreason = [["1", "个人申请"], ["2", "部门建议"], ["3", "晋升"], ["4", "不胜任原岗位"], ["5", "违规违纪"], ["6", "其他"]];
//调配原因
var turnovertype = [["1", "晋升"], ["2", "借调"], ["3", "平级调动"], ["4", "降职"], ["5", "其他"]];
//异动类型
var category = [["1", "内训"], ["2", "外训"]];
//培训类别
var way = [["1", "网络"], ["2", "现场"], ["3", "网络及现场"]];
//培训方式
var aim = [["1", "获取证书"], ["2", "考试合格"]];
//培训目标
var maritalstatus = [["1", "已婚"], ["2", "未婚"]];
//婚姻状况
var party = [["1", "共产党党员"], ["2", "民主党派"], ["3", "团员"], ["4", "无党派"], ["5", "群众"]];
//政治面貌
var bloodtype = [["1", "A"], ["2", "B"], ["3", "O"], ["4", "AB"]];
//血型
var certificates = [["1", "编制"], ["2", "审核"], ["3", "全国造价员证"], ["4", "其他"]];
//证件
var applyForFormal = [["1", "同意转正"], ["0", "同意转试用"], ["2", "不同意"], ["3", "延期"]];
//转正审批
var quittype = [["1", "个人辞职"], ["2", "辞退"], ["3", "退休"], ["4", "自离"]];
//离职类型
var quitreason = [["就学深造", "就学深造"], ["家庭因素", "家庭因素"], ["薪资福利待遇过低", "薪资福利待遇过低"], ["工作压力", "工作压力"], ["个人发展", "个人发展"], ["考核不合格", "考核不合格"], ["个人健康问题", "个人健康问题"], ["团队问题", "团队关系"], ["合同期满", "合同期满"], ["管理、不适应", "管理、文化不适应"], ["外地工作", "外地工作"], ["伤亡", "伤亡"], ["违反法律法规", "违反法律法规"], ["未通过试用期", "未通过试用期"], ["违反公司规定", "违反公司规定"], ["机构调整", "机构调整"], ["竞聘落选", "竞聘落选"], ["其它原因", "其它原因"]];
//离职原因
var documenttype = [["1", "职称证"], ["2", "注册证"], ["3", "执业资格证"], ["4", "合格证"], ["5", "继续教育证"], ["6", "会员证"], ["7", "专家证"], ["8", "个人毕业证"], ["9", "其它"]];
//证件类型
var contracttype = [["1", "劳动合同（领导）"], ["2", "劳动合同（员工）"], ["3", "劳务协议"], ["4", "变更协议"]];
//劳动合同类型
var signtimelimit = [["1", "1年"], ["3", "3年"], ["6", "6年"], ["0", "无时间期限"], ["-1", "不续签"]];
//合同签订时限
var clienttype = [["1", "集团、公司"], ["2", "医疗机构"], ["3", "一般公司"], ["4", "审计局"], ["5", "公共单位"], ["6", "科研单位"], ["7", "项目总承包"], ["8", "教育机构"], ["9", "银行"], ["10", "未知"], ["11", "开发商"], ["12", "评审机构"], ["13", "社会机构"], ["16", "国营企业"], ["14", "政府机构"], ["15", "投资公司"]];
//客户类别
var unit = [["kg", "kg"], ["m2", "m2"], ["m3", "m3"], ["m", "m"], ["套", "套"], ["个", "个"], ["台", "台"], ["根", "根"], ["芯", "芯"], ["只", "只"], ["株", "株"], ["樘", "樘"], ["座", "座"], ["付", "付"], ["T", "T"], ["KVA", "KVA"], ["KV", "KV"], ["KW", "KW"], ["元", "元"], ["项", "项"], ["公里", "公里"]];
//计量单位
var watermark = [["0", "不要水印"], ["1", "文字"], ["2", "图片"]];
//水印方式
var landNature = [["住宅", "住宅"], ["商业", "商业"], ["商兼住", "商兼住"], ["住兼商", "住兼商"], ["其他", "其他"]];
//住宅性质
var peopleAirMeasuring = [["统筹自建", "统筹自建"], ["异地建设", "异地建设"]];
//人防测量
var nature = [["1", "奖励"], ["2", "惩罚"]];
//奖惩性质
var datevariable = [["yyyy", "yyyy"], ["yyyymm", "yyyymm"], ["yyyymmdd", "yyyymmdd"], ["yyyymmddHHmmss", "yyyymmddHHmmss"]];
//日期变量
var systemvariable = [["当前登录人部门", "当前登录人部门"], ["当前登录人岗位", "当前登录人岗位"], ["当前登录人名字", "当前登录人名字"], ["当前登录人部门、岗位", "当前登录人部门、岗位"], ["当前登录人部门、岗位、姓名", "当前登录人部门、岗位、姓名"], ["当前人部门编号", "当前人部门编号"]];
//系统变量
var indexRanges = [["0", "项目"], ["1", "单体"], ["2", "户型"], ["3", "房间"], ["4", "公共区域精装修"], ["5", "住宅产品户内精装修"], ["6", "非住宅产品户内精装修"], ["8", "非住宅分区域"], ["9", "楼层公共区域精装修"]];
//指标适用范围
var provincecode = [["京", "北京"], ["津", "天津"], ["冀", "河北"], ["晋", "山西"], ["蒙", "内蒙古"], ["辽", "辽宁"], ["吉", "吉林"], ["黑", "黑龙江"], ["沪", "上海"], ["苏", "江苏"], ["浙", "浙江"], ["皖", "安徽"], ["闽", "福建"], ["赣", "江西"], ["鲁", "山东"], ["豫", "河南"], ["鄂", "湖北"], ["湘", "湖南"], ["粤", "广东"], ["桂", "广西"], ["琼", "海南"], ["渝", "重庆"], ["川", "四川"], ["云", "云南"], ["藏", "西藏"], ["陕", "陕西"], ["贵", "贵州"], ["甘", "甘肃"], ["青", "青海"], ["宁", "宁夏"], ["新", "新疆"], ["港", "香港"], ["澳", "澳门"], ["台", "台湾"]];
//地区简写
var reportresult = [["全1", "全过程"], ["估2", "投资估算编制"], ["估3", "投资估算审核"], ["概4", "工程概算编制"], ["概5", "工程概算审核"], ["预6", "工程预算编制"], ["预7", "工程预算审核"], ["清8", "工程量清单编制"], ["清9", "工程量清单审核"], ["控10", "控制价编制"], ["控11", "控制价审核"], ["结12", "工程结算编制"], ["结13", "工程结算审核"], ["决14", "竣工决算编制"], ["决15", "竣工决算审核"], ["评16", "投资估算评审"], ["评17", "工程概算评审"], ["评18", "工程预算评审"], ["评19", "工程量清单评审"], ["评20", "控制价评审"], ["评21", "工程结算评审"], ["评22", "竣工决算评审"], ["评23", "其他评审"], ["鉴24", "司法鉴定"], ["零25", "其他（编制类）"], ["零26", "其他（审核类）"], ["预27", "三单审核"]];
//报告成果
var projectroleSecond = [["4", "土建造价工程师"], ["5", "安装造价工程师"], ["6", "景观造价工程师"], ["7", "装饰造价工程师"], ["8", "市政造价工程师"]];
//项目角色2
var sealcategory = [["1", "法人章"], ["2", "公章"], ["3", "造价员"], ["4", "造价师"], ["5", "建造师"], ["8", "司法鉴定"], ["9", "监理师"], ["11", "工程咨询师"], ["13", "财务章"], ["12", "其它"]];
//印章类别
var projectroleFirst = [["1", "项目总负责人"], ["2", "土建造价项目经理"], ["3", "安装造价项目经理"]];
//项目角色1
var costnature = [["1", "项目经理费用"], ["2", "业务绩效费用"]];
//费用性质
var projectrole = [["0", "算量中心负责人"], ["1", "项目总负责人"], ["2", "土建造价项目经理"], ["3", "安装造价项目经理"], ["4", "土建造价工程师"], ["5", "安装造价工程师"], ["6", "景观造价工程师"], ["7", "装饰造价工程师"], ["8", "市政造价工程师"]];
//项目角色
var empstatus = [["1", "实习"], ["2", "试用"], ["3", "正式"], ["4", "离职"], ["5", "离职审批中"], ["6", "退休"]];
//员工状态
var empfiletype = [["1", "身份证正面照"], ["2", "身份证反面照"], ["3", "学历证扫描件"], ["4", "学位证扫描件"], ["5", "执业资格证扫描件"], ["6", "本人能力相关证明"], ["7", "离职证明"], ["8", "其它"]];
//员工信息表附件类型
var bankcard = [["1", "招商银行"], ["2", "中国工商银行"], ["3", "中国建设银行"], ["4", "中国农业银行"], ["5", "中国银行"], ["6", "交通银行"], ["7", "华夏银行"], ["8", "兴业银行"], ["9", "上海银行"], ["10", "中国民生银行"], ["11", "广发银行ICGB"], ["12", "平安银行"], ["13", "中信银行"], ["14", "中国光大银行"], ["15", "中国邮政储蓄银行"], ["16", "北京银行"], ["17", "成都银行"], ["18", "攀枝花商业银行"], ["19", "农商银行"], ["20", "浦发银行"], ["21", "城市商业银行"], ["22", "农村商业银行"]];
//银行卡
var codetype = [["101", "开元数智工程咨询集团有限公司-党委"], ["100", "开元数智工程咨询集团有限公司"], ["102", "开元数智工程咨询集团有限公司-工会"], ["201", "开元咨询董事会"], ["202", "开元咨询总裁办"], ["210", "开元咨询运营中心"], ["211", "开元咨询质控中心"], ["212", "开元咨询共享作业中心"], ["203", "开元咨询人力行政中心"], ["204", "开元咨询财务中心"], ["205", "开元咨询纠纷调解中心"], ["209", "开元咨询品牌文化中心"], ["217", "开元咨询市场管理中心"], ["218", "开元咨询各分公司"], ["213", "开元咨询研发中心"], ["214", "开元咨询全过程管理中心"], ["215", "开元咨询各部门"], ["216", "开元咨询数智中心"], ["208", "部门发文-甘肃分公司"], ["206", "部门发文-贵州分公司"], ["207", "部门发文-重庆分公司"], ["13", "借支单"], ["14", "回款登记"], ["15", "员工编码--董事会"], ["16", "员工编码--合伙人"], ["17", "员工编码--经理/总监"], ["33", "员工编码--副经理/副总监"], ["18", "员工编码--技术人员"], ["19", "员工编码--支撑人员"], ["20", "请假申请表"], ["21", "任务派发单"], ["22", "快递单号"], ["23", "入库单编号"], ["24", "领用单编号"], ["25", "采购单编号"], ["26", "借阅编号"], ["27", "归还编号"], ["28", "晋升审批编号"], ["29", "保证金编号"], ["31", "用印申请"], ["30", "投标审批编号"], ["32", "人员需求编号"], ["35", "额外绩效工作编码"], ["34", "研发工作"], ["35", "共享任务发布编码"], ["36", "共享成果审批"], ["37", "共享作业任务单编码"], ["38", "质量处罚单编码"], ["39", "项目房屋流水号"], ["2", "审核清单"], ["3", "客户"], ["4", "咨询合同"], ["5", "甲方开票登记"], ["6", "申请开票"], ["7", "绩效奖励申请"], ["8", "印章登记"], ["9", "报告号"], ["10", "审核清单"], ["11", "费用报销"], ["12", "差旅费报销"], ["1", "劳动合同登记"], ["55", "知识库课程标题编号"], ["58", "工商年报编号"], ["59", "知识库投稿编号"], ["60", "人员面谈"], ["61", "巡检填报"], ["62", "师带徒师徒结对"]];
//编码类型
var isread = [["0", "未读"], ["1", "已读"]];
//阅读否
var nation = [["1", "汉族"], ["2", "蒙古族"], ["3", "回族"], ["4", "藏族"], ["5", "维吾尔族"], ["6", "苗族"], ["7", "彝族"], ["8", "壮族"], ["9", "布依族"], ["10", "朝鲜族"], ["11", "满族"], ["12", "侗族"], ["13", "瑶族"], ["14", "白族"], ["15", "土家族"], ["16", "哈尼族"], ["17", "哈萨克族"], ["18", "傣族"], ["19", "黎族"], ["20", "傈僳族"], ["21", "佤族"], ["22", "畲族"], ["23", "高山族"], ["24", "拉枯族"], ["25", "水族"], ["26", "东乡族"], ["27", "纳西族"], ["28", "景颇族"], ["29", "柯尔克孜族"], ["30", "土族"], ["31", "达斡尔族"], ["32", "仫佬族"], ["33", "羌族"], ["34", "布朗族"], ["35", "撒拉族"], ["36", "毛南族"], ["37", "仡佬族"], ["38", "锡伯族"], ["39", "阿昌族"], ["40", "普米族"], ["41", "塔吉克族"], ["42", "怒族"], ["43", "乌孜别克族"], ["44", "俄罗斯族"], ["45", "鄂温克族"], ["46", "德昂族"], ["47", "保安族"], ["48", "裕固族"], ["49", "京族"], ["50", "塔塔尔族"], ["51", "独龙族"], ["52", "鄂伦春族"], ["53", "赫哲族"], ["54", "门巴族"], ["55", "珞巴族"], ["56", "基诺族"], ["57", "穿青人"]];
//民族
var contractcategory = [["1", "主要框架合同"], ["2", "次要框架合同"], ["3", "非框架合同"]];
//合同类型
var ishavecontract = [["1", "存在派单或合同"], ["2", "无派单或合同"]];
//是否存在合同
var degree = [["1", "无"], ["2", "学士"], ["3", "硕士"], ["4", "博士"]];
//学位
var flowStatus = [["0", "无效"], ["1", "使用中"], ["2", "编辑中"]];
//工作流状态
var indexTypes = [["0", "经济指标"], ["1", "相关性指标"]];
//指标类型
var subjecttype = [["1", "判断题"], ["2", "单选题"], ["3", "多选题"], ["4", "填空题"], ["5", "论述题"], ["6", "案例"], ["7", "清单编制"]];
//试题类型
var paperStatus = [["0", "编辑"], ["1", "发布 "]];
//试卷状态
var level = [["15", "董事会"], ["16", "合伙人"], ["17", "经理/总监"], ["33", "副经理/副总监"], ["18", "技术人员"], ["19", "支撑人员"]];
//岗位等级
var scantype = [["1", "报告封面"], ["2", "定案表"]];
//工单成果扫描件类型
var contractContents = [["0", "清单及招标预算价"], ["1", "施工阶段全过程造价控制"], ["2", "工程竣工结算"], ["3", "效益费"], ["4", "其他"]];
//合同内容
var major = [["1", "土建"], ["2", "安装"], ["3", "景观"], ["4", "幕墙"], ["5", "市政（公路、水利、地铁等）"], ["6", "精装"]];
//项目专业
var onsitesituation = [["1", "驻场"], ["2", "半驻场"], ["3", "项目协调"]];
//驻场情况
var workrange = [["1", "总包"], ["2", "分包"]];
//工作所属范围
var reportworkstatus = [["0", "未审批"], ["1", "审批中"], ["2", "完成审批"]];
//报表中流程状态
var pricefromtype = [["0", "单价面积类"], ["1", "费率类"], ["2", "文件类"]];
//价格组成明细类型
var contractPricetype = [["0", "合同暂定金额"], ["1", "计算金额"]];
//合同价格分类
var feetype = [["0", "总包"], ["1", "分包"]];
//价格分类
var natureMeeting = [["0", "部门例会"], ["1", "视频会议"], ["2", "研讨会"], ["3", "表彰会"], ["4", "全体大会"], ["5", "月度例会"]];
//会议性质
var leaveconditions = [["性别", "性别"], ["工龄", "工龄"], ["司龄", "司龄"], ["入职时间", "入职时间"], ["员工状态", "员工状态"]];
//请假条件
var holidaytype = [["1", "固定"], ["2", "非固定"], ["3", "公式配置"]];
//假期类型
var majorLevel = [["1", "房产-安装"], ["2", "房产-土建"], ["3", "政府-安装"], ["4", "政府-土建"], ["5", "市政-土建"], ["8", "市政-安装"], ["6", "公路"], ["7", "水利"]];
//质量复核-专业
var checkLevel = [["1", "一级"], ["2", "二级"], ["3", "三级"]];
//质量复核-等级
var jobrank = [["1", "1"], ["2", "2"], ["3", "3"], ["4", "4"], ["5", "5"], ["6", "6"], ["7", "7"], ["8", "8"], ["9", "9"], ["10", "10"], ["11", "11"], ["12", "12"], ["13", "13"], ["14", "14"], ["15", "15"], ["16", "16"], ["17", "17"], ["18", "18"], ["19", "19"], ["20", "20"]];
//职级
var leavetype = [["1", "事假"], ["2", "婚假"], ["3", "病假"], ["4", "年假"], ["5", "产假"], ["7", "产检"], ["8", "其它有薪假"], ["9", "非直系丧假"], ["6", "直系丧假"]];
//请假类型
var handovertype = [["1", "部门"], ["2", "财务"], ["3", "人力前台"], ["4", "人力内勤"], ["5", "人力"], ["6", "行政"], ["7", "后台交接"]];
//交接类别
var confirmopinion = [["1", "确认交接完毕"], ["2", "存在问题（线下解决）"]];
//确认意见
var achievefiletype = [["1", "成果文件"], ["4", "打印文件"], ["2", "支撑文件"], ["3", "废除文件"]];
//成果审批文件类型
var peoples = [["2", "两大一小"], ["1", "一大两小"], ["0", "一大一小"], ["3", "两大两小"]];
//预计人数
var activitycontent = [["0", "亲子活动"], ["1", "主题活动"], ["2", "2021亲子活动"]];
//活动内容
var arrangement = [["1", "确认入住"], ["2", "取消入住"]];
//安排情况
var courierCompany = [["1", "圆通快递"], ["2", "中通快递"], ["3", "顺丰快递"], ["4", "EMS"], ["5", "京东快递"]];
//快递公司
var courierPayType = [["1", "自费"], ["2", "公费"], ["3", "到付"]];
//快递费用方式
var certificate = [["1", "营业执照"], ["2", "开户许可证"]];
//证件类型
var datasources = [["2", "接口获取"], ["3", "excel批量导入"]];
//目标成本-数据来源
var pushtype = [["0", "直接成本"], ["1", "建筑面积"], ["2", "测算面积"]];
//推送类型
var calculateStatus = [];
//目标成本计算状态
var inputType = [["1", "手动录入"], ["1", "配置表公式"], ["3", "四则运算"], ["4", "下级汇总"]];
//输入类型
var formulatype = [["0", "参数引入"], ["1", "横向汇总"], ["2", "横向均摊"], ["3", "四则运算"], ["4", "下级汇总"], ["5", "手动录入"], ["6", "编制说明"]];
//公式类型
var costRanges = [["0", "项目"], ["10", "业态"]];
//测算适用范围
var assettypes = [["0", "非固定资产"], ["1", "固定资产"]];
//资产类型
var consumables = [["0", "非消耗品"], ["1", "消耗品"]];
//是否为消耗品
var promotiontable = [["1", "个人总结PPT"], ["2", "专业评审组评审结论汇总表"], ["3", "评审委员会职级评定会议记表"]];
//人员晋升
var supervisionType = [["2", "单价"], ["2", "总价"], ["4", "费率"]];
//监理分类
var professionaltype = [["0", "土建"], ["1", "安装"], ["2", "景观"], ["3", "装饰"], ["4", "市政"], ["5", "其它"]];
//人员需求--专业方向
var demandreason = [["0", "替岗"], ["1", "新增"], ["2", "储备"]];
//需求原因
var margintype = [["0", "投标保证金"], ["1", "履约保证金"]];
//保证金类型
var wintype = [["0", "中标"], ["1", "未中标"]];
//是否中标
var bidtype = [["1", "评审"], ["2", "预算清单、控制价"], ["3", "结算审计"], ["4", "全过程"], ["5", "跟踪审计"], ["6", "PPP"]];
//投标类型
var tenderresult = [["1", "中标"], ["2", "未中标"], ["3", "废标"]];
//投标结果
var usesealreason = [["1", "外借"], ["2", "使用"]];
//用印事由
var taxableservicesname = [["咨询服务", "咨询服务"]];
//应税劳务、服务名称
var mailtype = [["0", "自取"], ["1", "邮寄甲方"], ["2", "邮寄分公司"]];
//票据处理方式
var misscard = [["1", "上午"], ["2", "下午"], ["3", "全天"]];
//忘记打卡
var promotionResults = [["1", "成功"], ["0", "失败"]];
//晋升结果
var wageGSType = [["1", "手动输入"], ["2", "计算参数"], ["3", "内部数据引用"], ["4", "四则运算"], ["5", "逻辑运算"], ["6", "固定值"], ["7", "上月薪资数据"], ["8", "年度累计"]];
//薪资公式类型
var salaryStatus = [["0", "计算准备"], ["1", "计算中"], ["2", "计算完毕"], ["3", "审批中"], ["4", "审批完毕"], ["5", "已封帐"]];
//发薪状态
var site_type = [["0", "慧讯网"], ["1", "造价通"], ["2", "四川材价"], ["3", "易择网"], ["4", "我的钢铁网"], ["5", "广材网"], ["6", "上海有色金属网"], ["7", "线缆之家"], ["8", "宏业领材网"]];
//网站类型
var annual_type = [["1", "现场员工"], ["2", "异地员工"], ["3", "现场嘉宾"]];
//年会类型
var is_allow = [["0", "不允许"], ["1", "允许"]];
//是否允许
var attend_rule = [["0", "姓名+手机"], ["1", "姓名+扩展码"], ["2", "手机"], ["3", "扩展码"]];
//签到规则
var prize_range = [["1", "全部"], ["2", "签到人员"], ["3", "未签到人员"]];
//抽奖范围
var prize_status = [["0", "未抽"], ["1", "已抽"]];
//抽奖状态
var worktype = [["1", "算量"], ["2", "踏勘"], ["3", "开会"], ["100", "其它"]];
//工时类别
var financetype = [["1", "业务数据"], ["2", "人员数据"], ["3", "市场数据"], ["4", "财务数据"]];
//核心数据类型
var incometype = [["1", "造价咨询/全过程造价咨询"], ["10", "造价咨询/估(概)算编制"], ["11", "造价咨询/估(概)算评审"], ["12", "造价咨询/清单控制价编制"], ["13", "造价咨询/清单控制价评审"], ["14", "造价咨询/结算编制"], ["15", "造价咨询/结算审核"], ["8", "造价咨询/司法鉴定"], ["9", "造价咨询/其他"], ["7", "招标代理"], ["5", "工程咨询"], ["17", "工程监理"], ["6", "项目管理"], ["18", "其他"], ["19", "全过程工程咨询"]];
//收入类型
var billmajortype = [["1", "房屋建筑工程"], ["2", "市政工程"], ["3", "公路工程"], ["7", "铁路工程"], ["8", "水电工程"], ["9", "火电工程"], ["5", "水利工程"], ["4", "轨道交通工程"], ["10", "石油化工工程"], ["11", "电力通信工程"], ["6", "其他"]];
//开票专业类型
var performancerange = [["1", "员工"], ["2", "部门"], ["3", "项目"]];
//绩效考核适用范围
var graderrange = [["1", "考核对象自己"], ["2", "考核对象部门领导"], ["3", "其他"]];
//考核评分人范围
var coredatatype = [["1", "总裁办"], ["2", "造价管理中心"], ["3", "全过程管理中心"], ["4", "前研中心"], ["5", "其他"]];
//部门核心数据类型
var calculatetype = [["1", "清单编制"], ["2", "控制价"], ["3", "工程量计算"], ["4", "工程量核对"]];
//计量类别
var commissionupdatetype = [["1", "存票修改"], ["2", "入账"], ["3", "扣款"]];
//提现修改类型
var jobtype = [["1", "管理岗"], ["2", "项目经理"], ["3", "工程师"], ["4", "实习生"], ["5", "职能岗"]];
//岗位归属类型
var wpstypes = [["0", "手动"], ["1", "自动"], ["2", "手动+自动"]];
//wps模块数据方式
var jobtypes = [["0", "填写内容"], ["1", "上传文件"], ["2", "填写内容和上传文件"]];
//工作平台-工作类型
var jobstatus = [["0", "未完成"], ["1", "完成"]];
//工作平台-工作状态
var tableType = [["0", "检查要点"], ["1", "基本情况"], ["2", "行子表"]];
//自定义表类型
var workstatus = [["0", "类型"], ["1", "内容"]];
//工作内容类型
var control_type = [["0", "输入框"], ["1", "多行文本输入框"], ["2", "选择框"], ["3", "复选框"], ["4", "文件关联"], ["5", "日期（年月日）"], ["6", "日期（年月日+时间）"]];
//控件类型
var crm_type = [["0", "新建客户"], ["1", "潜在客户"], ["2", "重要客户"]];
//客户类型
var usesys = [["0", "未使用"], ["1", "在使用"]];
//是否使用系统
var usage = [["0", "差"], ["1", "一般"], ["2", "好"]];
//系统使用情况
var poolstate = [["0", "已分配"], ["1", "解除分配"]];
//分配池状态
var tracktype = [["0", "电话"], ["1", "微信"], ["2", "面谈"], ["3", "短信"]];
//跟进方式
var customerstate = [["0", "未分配"], ["1", "跟进中"], ["2", "已成交"], ["3", "无意向"]];
//客户状态
var companysize = [["0", "微型企业(人数<20)"], ["1", "小型企业(20<=人数<100)"], ["2", "中型企业(100<=人数<200)"], ["3", "大型企业(人数>=200)"]];
//公司规模
var promotiontype = [["1", "晋升"], ["2", "调薪"]];
//晋升类型
var buyStatus = [["1", "未支付"], ["2", "已支付待确认"], ["3", "已收款待发货"], ["4", "已发货"], ["5", "已收货"]];
//大米购买状态
var lockStatus = [["1", "使用中"], ["2", "停用"], ["3", "丢失"], ["4", "已退还"], ["5", "损坏"]];
//软件锁状态
var quitwhereabouts = [["地产公司", "地产公司"], ["施工单位", "施工单位"], ["深造考试", "深造考试"], ["异地发展", "异地发展"], ["独立承接项目", "独立承接项目"], ["转其他行业", "转其他行业"], ["健康问题、待业", "健康问题、待业"]];
//离职去向
var cw_type = [["0", "季度绩效工资评价"], ["1", "季度绩效奖励工资评价"], ["2", "职务晋升"]];
//cw类型
var business_type = [["0", "过控"], ["1", "坐班"], ["2", "职能"]];
//业务类型
var index_type = [["0", "推进执行类"], ["1", "职业养成类"], ["2", "进取创新类"]];
//指标类别
var okr_flow_status = [["0", "启动"], ["1", "下一步"], ["2", "完成"], ["3", "退回发起人"], ["4", "可批量审批"], ["5", "批量审批中"]];
//okr流程状态
var quarter = [["1", "一季度"], ["2", "二季度"], ["3", "三季度"], ["4", "四季度"]];
//季度
var okr_status = [["0", "编辑中"], ["1", "明细审批中"], ["2", "明细审批完成"], ["3", "分数审批中"], ["4", "分数审批完成"]];
//okr审批状态
var specialColl = [["1", "保理"], ["2", "商业承兑"], ["3", "银行承兑"], ["4", "抵房"]];
//特殊收款方式
var socialsecuritytype = [["1", "社保变更"], ["2", "公积金变更"]];
//社保公积金变更类型
var projectproerty = [["1", "地产"], ["2", "政府及民营"]];
//项目性质
var qcategory = [["1", "工程造价类"], ["2", "工程施工类"], ["3", "工程咨询类"], ["4", "工程监理类"], ["5", "招标代理类"], ["6", "人力资源类"], ["7", "财会、税务类"], ["8", "司法类"], ["9", "PPP类"], ["10", "评标/采购评审类"], ["11", "其它"]];
//证件类别
var qmajorcategory = [["1", "土建"], ["2", "安装"], ["3", "公路/铁路、城市轨道交通"], ["4", "水利水电"], ["5", "房屋建筑施工"], ["6", "机电"], ["7", "市政"], ["8", "投资"], ["9", "项目数据分析"], ["10", "建筑经济管理"], ["11", "建筑装饰"], ["14", "工程造价"], ["12", "工业与民用建筑"], ["13", "其它"], ["15", "工商管理"], ["16", "土木建筑工程"], ["17", "建筑经营管理"], ["18", "工民建"], ["19", "会计"], ["20", "焊接工艺设备"], ["21", "建设工程与政府采购招投标"], ["22", "给排水工程"], ["23", "建筑工程管理"], ["24", "建筑电气工程"], ["25", "建筑结构工程"], ["26", "建筑工程技术"], ["27", "建筑业"]];
//证件专业
var certificatelevel = [["1", "国家级"], ["2", "省级"], ["3", "市级"], ["4", "高级"], ["5", "中级"], ["6", "初级"], ["7", "助理级"], ["8", "一级"], ["9", "二级"], ["10", "三级"], ["11", "专科"], ["12", "本科"], ["13", "硕士"], ["14", "其它"]];
//证件级别
var subsidytype = [["1", "月度工资发放"], ["2", "年度发放"], ["3", "无费用"], ["4", "其它"]];
//补贴发放方式
var jjfs = [["1", "清单计价"], ["2", "定额计价(含工程计价文件)"], ["3", "定额计价(不含工程计价文件)"], ["4", "其他"]];
//备案-计价方式
var fbfs = [["1", "直接发包"], ["2", "招标发包(比选)"]];
//备案-发包方式
var zxlx = [["1", "投资估算"], ["2", "设计概算"], ["3", "预算"], ["4", "工程量清单"], ["5", "控制价"], ["6", "施工过程造价控制价"], ["7", "全过程造价控制"], ["8", "施工设计总承包过程造价控制"], ["9", "合约规划与招采策划"], ["10", "工程造价数据积累咨询"], ["11", "建设项目管理"], ["12", "结算审核"], ["13", "设计方案经济分析"], ["14", "专项施工方案造价测算"], ["15", "设计方案优化"], ["16", "司法鉴定"], ["17", "项目建设书"], ["18", "项目呆行性研究报告"], ["19", "其它"]];
//备案-咨询类型
var lxbm = [["1", "省发展改革委审批、核准、备案"], ["2", "市(州）行政区域内同级发展改革部门"], ["3", "区(县）行政区域内同级发展改革部门"]];
//备案-立项部门
var gclx = [["1", "房屋建筑工程"], ["2", "仿古建筑工程"], ["3", "市政园林工程"], ["4", "建筑总平工程"], ["5", "构筑物工程"], ["6", "爆破工程"], ["7", "城市轨道交通工程"]];
//备案-工程类型
var xmlb = [["1", "房屋建筑工程"], ["2", "市政工程"], ["3", "其他"]];
//备案-合同项目类别
var htqdlx = [["1", "独立项目合同"], ["2", "年度或项目大合同"]];
//备案-合同签订类型
var htbalx = [["1", "工程总承包(EPC)"], ["2", "建筑施工"], ["3", "工程监理"], ["4", "招标代理"], ["5", "工程造价"], ["6", "项目管理合同"], ["9", "其他工程类型合同"]];
//备案-备案类型
var worknature = [["1", "后台"], ["2", "驻场"]];
//工作性质
var tender_major = [["0", "土建"], ["1", "安装"]];
//投标测算提成专业
var tender_type = [["0", "单价类"], ["1", "费率类"], ["2", "景观"]];
//投标测算业态类型
var tender_budget_type = [["0", "预算"], ["1", "结算"], ["3", "司法鉴定"], ["4", "估算设计概算"], ["5", "管理审计、尽职调查"], ["6", "信息咨询"], ["7", "招标代理"], ["8", "采购代理"], ["9", "需求论证"], ["10", "履约验收"], ["11", "咨询服务"], ["12", "项目备案"], ["13", "监理"], ["14", "项目管理"], ["15", "工程咨询"], ["16", "工程咨询（ppp）"], ["17", "工程咨询（可研）"], ["18", "投资决策"], ["19", "工程咨询（其他）"], ["20", "勘察"], ["21", "设计"], ["99", "全过程"]];
//投标测算计算类型
var tender_format_type = [["0", "住宅"], ["1", "商业"], ["2", "市政"]];
//投标测算业态分类
var tender_land_type = [["0", "软景"], ["1", "硬景"]];
//投标测算景观分类
var branddesign = [["1", "VI设计"], ["2", "UI设计"], ["3", "Logo设计"], ["4", "形象墙设计"], ["5", "文化墙设计"], ["6", "吉祥物设计"], ["7", "名片设计"], ["8", "海报设计"], ["9", "展架设计"], ["10", "折页设计"], ["11", "画册设计"], ["12", "内刊设计"], ["13", "网页设计"], ["14", "PPT设计"], ["15", "H5设计"], ["16", "包装设计"], ["17", "活动设计"], ["18", "KT版设计"], ["19", "节日氛围设计"], ["20", "图片处理"]];
//品牌设计类型
var branddocument = [["1", "宣传文案"], ["2", "讲话稿"], ["3", "新闻稿"], ["4", "公开信"], ["5", "主持稿"], ["6", "海报文案"], ["7", "策划方案"], ["8", "上报材料"]];
//品牌文案策划类
var brandvideo = [["1", "图片拍摄"], ["2", "短视频拍摄"], ["3", "宣传片拍摄"], ["4", "VR拍摄"], ["5", "航拍"], ["6", "视频制作"], ["7", "动画制作"]];
//品牌图片视频拍摄制作
var brandpublicity = [["1", "网站"], ["2", "微信公众号"], ["3", "微信视频号"], ["4", "公关活动"]];
//品牌推广类
var brandcontribute = [["1", "新闻稿"], ["2", "技术稿"], ["3", "视频稿"], ["4", "人物稿"]];
//品牌投稿系统
var brandactivity = [["1", "企业文化培训"], ["2", "文化活动支持"], ["3", "公关活动支撑"]];
//品牌企业文化活动支持
var businessWay = [["1", "协作开发"], ["2", "自行开发"]];
//业务-备案
var businessFee = [["0", "单价"], ["1", "费率"]];
//市场费用类型
var quotation_rules = [["0", "按四川省141号文"], ["1", "固定总价"], ["2", "单价类"], ["3", "费率类"], ["4", "其他报价规则"]];
//投标报价规则
var bidding_price_type = [["0", "单价类"], ["1", "费率类"], ["2", "总价"], ["3", "上下浮"]];
//投标报价类型
var isoffsetbill = [["1", "要开发票"], ["0", "不开发票"]];
//是否开具发票
var subjectcity = [["1", "全国"], ["2", "四川"], ["3", "重庆"], ["4", "北京"], ["5", "天津"], ["6", "河北"], ["7", "山西"], ["8", "内蒙古"], ["9", "辽宁"], ["10", "吉林"], ["11", "黑龙江"], ["12", "上海"], ["13", "江苏"], ["14", "浙江"], ["15", "安徽"], ["16", "福建"], ["17", "江西"], ["18", "山东"], ["19", "河南"], ["20", "湖北"], ["21", "湖南"], ["22", "广东"], ["23", "广西"], ["24", "海南"], ["25", "云南"], ["26", "西藏"], ["27", "贵州"], ["28", "陕西"], ["29", "甘肃"], ["30", "青海"], ["30", "青海"], ["32", "新疆"]];
//试题城市
var subjectway = [["1", "计量"], ["2", "计价"], ["3", "现场"]];
//试题范围
var subjectdifficulty = [["1", "易"], ["2", "难"]];
//试题难易度
var subjectspecial = [["1", "土建"], ["2", "安装-水"], ["3", "安装-暖"], ["4", "安装-电"], ["5", "安装-消防"], ["6", "园林景观"], ["7", "精装修"], ["8", "市政"], ["9", "企业文化"], ["10", "党建"], ["11", "其他"]];
//试题专业
var subjectlevel = [["1", "初级工程师"], ["2", "中级工程师"], ["3", "项目经理"]];
//试题等级
var projectdataparamtype = [["1", "绩效奖励"], ["2", "人力成本"], ["3", "费用报销"], ["4", "其它"]];
// 项目成本分析参数类别
var fundtype = [["1", "结算款"], ["2", "进度款"]];
//
var paramcategory = [["2", "通用"], ["1", "全过程参数"], ["0", "非全过程参数"]];
//参数性质
var contents_invest_type = [["0", "政府"], ["0", "政府"], ["1", "地产"], ["1", "地产"]];
//文件目录投资类型
var invest_type = [["0", "政府投资"], ["1", "企业投资"]];
//投资类别
var tender_business_type = [["0", "跟踪审计"], ["1", "评审"], ["2", "清单控制价"], ["3", "竣工结算审核"], ["4", "管理审计"], ["5", "全过程控制"], ["6", "清单（控制价）"], ["7", "预结算审核（复核）"]];
//招投标业务类型
var project_format = [["0", "室内精装修"], ["1", "总评景观"], ["2", "写字楼"], ["3", "酒店"], ["4", "商业"], ["5", "18层以上住宅"], ["6", "8~18层住宅"], ["7", "7层以下（含洋房）"], ["8", "别墅"], ["9", "市政"], ["10", "其他"]];
//招投标项目业态
var contents_type = [["1", "子目录"]];
//招投标目录拆分类型
var exportfile = [["1", "身份证"], ["2", "学历证"], ["3", "职称证"], ["4", "专家证"], ["5", "注册证"], ["6", "优秀证书"], ["7", "业绩、成果或专业实力证明"], ["8", "其它"]];
//专家库附件
var exportmajor = [["1", "全过程"], ["2", "造价"], ["3", "项目管理"], ["4", "PPP"], ["5", "监理"], ["6", "招投标"], ["7", "设计"], ["8", "人力资源"], ["9", "财务"], ["10", "IT"]];
//专家申请专业
var spdisclosefiletype = [["10", "咨询合同"], ["11", "施工合同"], ["12", "图纸附件"], ["13", "招标附件"], ["14", "特殊计量规则"], ["15", "其他文件"]];
//交底文件类型
var spauditlistfiletype = [["1", "编制说明"], ["2", "计价文件"], ["3", "计算底稿"], ["4", "指标表"], ["5", "其他文件"]];
//共享成果文件类型
var pricingmodel = [["1", "定额计价模式"], ["2", "清单模式"], ["3", "不区分"]];
//收费基数
var chargingbase = [["1", "审定工程造价"], ["2", "送审工程造价/审定工程造价X1.1"], ["4", "投资额"], ["5", "送审工程造价"], ["6", "工程造价"], ["7", "元\单位"], ["8", "鉴定标准（%）"]];
//计费模式
var degreeurgency = [["1", "一天以内"], ["2", "三天以内"], ["3", "一周以内"]];
// 紧急程度
var qualityCheckType = [["1", "计价文件的质量考核"], ["2", "咨询报告编制考核内容"], ["3", "咨询流程考核内容"]];
//质量考核类别
var qualityType = [["%", "%"], ["处", "处"], ["次", "次"], ["份", "份"], ["工作日", "工作日"]];
//质量考核单位
var calculatesw = [["1", "广联达"], ["2", "斯维尔"], ["3", "鹏业"], ["4", "算王"]];
//计价软件类别
var valuationsw = [["1", "宏业"], ["2", "广联达"], ["3", "鹏业"], ["4", "业主模板"], ["5", "自定义"]];
//计量软件
var punishedLevel = [["1", "一级处罚发起人"], ["2", "二级处罚一级"], ["3", "三级处罚二级"], ["4", "终审处罚三级"]];
//质量处罚级别
var sangjia_type = [["父母", "父母"], ["配偶", "配偶"], ["子女", "子女"], ["配偶父母", "配偶父母"], ["祖父母", "祖父母"], ["外祖父母", "外祖父母"], ["亲兄弟姊妹（包含配偶方）", "亲兄弟姊妹（包含配偶方）"]];
//亲属类型
var welfareType = [["0", "生育福利"]];
//福利类型
var pickUpWay = [["0", "邮寄"], ["1", "公司自提"]];
//取件方式
var commissiontype = [["1", "房地产类"], ["2", "非房地产类"], ["3", "精装修"], ["4", "合伙人"]];
//绩效奖励类别
var decorationType = [["1", "装修"], ["2", "安装"]];
//绩效奖励精装修类型
var importance = [["1", "特急"], ["2", "紧急"], ["3", "常规"]];
//紧急程度
var postType = [["1", "通知"], ["2", "函"], ["3", "通报"], ["4", "会议纪要"], ["5", "发文"], ["6", "制度"], ["7", "其他"]];
//投稿发文类别
var deleteReason = [["1", "重复的图纸"], ["2", "上传类型错误未按要求格式上传"], ["3", "打包的压缩内容,同时又有解压内容"], ["4", "上传文件夹位置错误"], ["100", "文件存档"]];
//nas文件删除原因
var fixturestype = [["1", "CAD做法表"], ["2", "业主标准做法库"], ["3", "自定义"]];
//装修做法
var sptaskrate = [["1%以内", "1%以内"], ["1%~2%", "1%~2%"], ["2%~3%", "2%~3%"]];
//任务派发准确率
var earlyprojectstatus = [["1", "对接"], ["2", "落地"], ["3", "取消"]];
//前期咨询项目状态
var projectstatus = [["0", "进行中"], ["2", "缓建"], ["3", "终止"], ["4", "暂停"], ["1", "办结"]];
//项目状态
var moneyway = [["1", "政府投资项目"], ["0", "非政府投资项目"]];
//项目投资类型
var joinedstatus = [["1", "待入职"], ["2", "已入职"], ["3", "不再入职"], ["4", "已离职"], ["5", "入职后又离开"]];
//人员招聘入职
var checkstatus = [["0", "不同意录用"], ["1", "同意录用"]];
//人员招聘审批
var twoauditstatus = [["1", "是"], ["0", "否"], ["2", "咨询合同未明确"]];
//二审状态
var week = [["1", "第一周"], ["2", "第二周"], ["3", "第三周"], ["4", "第四周"], ["5", "第五周"]];
//周数
var weekday = [["1", "周一"], ["2", "周二"], ["3", "周三"], ["4", "周四"], ["5", "周五"], ["6", "周六"], ["7", "周日"]];
//周几
var itemstatus = [["1", "未完成"], ["2", "完成"], ["3", "终止"], ["4", "暂停"], ["5", "延期"]];
//工作事项状态
var expenseprojecttype = [["1", "跨省/市差旅费"], ["2", "市内交通费"], ["3", "车辆费用"]];
//差旅科目类别
var suit = [["0", "勤奋"], ["1", "刻苦"], ["2", "奋进"], ["3", "坚持"], ["4", "努力"], ["5", "冲鸭"], ["6", "自律"], ["7", "社牛"], ["8", "勤俭"], ["9", "乐观"], ["10", "成功"], ["11", "务实"], ["12", "果敢"], ["13", "打拼"], ["14", "拼搏"], ["15", "YYDS"], ["16", "C位逆袭"], ["17", "buff加成"], ["18", "自强"], ["19", "5G冲浪"], ["20", "逆袭"], ["21", "奥利给"]];
//宜
var avoid = [["0", "摸鱼"], ["1", "划水"], ["2", "迟到"], ["3", "早退"], ["4", "躺平"], ["5", "佛系"], ["6", "凡尔赛"], ["7", "emo"], ["8", "野性消费"], ["9", "当老六"], ["10", "带节奏"], ["11", "看戏"], ["12", "废话文学"], ["13", "摆烂"], ["14", "自我pua"], ["15", "内耗"], ["16", "对对对"], ["17", "柠檬精"], ["18", "彩虹屁"], ["19", "社恐"], ["20", "打酱油"], ["21", "暴饮暴食"], ["22", "颓废"], ["23", "得过且过"], ["24", "玩物丧志"], ["25", "浑浑噩噩"]];
//忌
var useHouseStatus = [["1", "使用中"], ["0", "暂停中"]];
// 是否使用房屋
var rangeInkm = [["0.1", "0.1"], ["0.2", "0.2"], ["0.5", "0.5"], ["1", "1"], ["3", "3"], ["5", "5"], ["7", "7"], ["9", "9"], ["11", "11"]];
//范围公里数
var sealStatus = [["1", "使用中"], ["0", "失效"]];
//印章状态
var classMajor = [["1", "通用"], ["2", "土建"], ["3", "安装"], ["4", "公路"], ["5", "铁路"], ["6", "机场"], ["7", "航港"], ["8", "水电"], ["9", "矿业"], ["10", "市政"], ["11", "通讯"]];
//课程专业
var scopeType = [["1", "通用课件"], ["2", "政府及国有企业"], ["3", "房地产企业"]];
//适用范围
var difficultType = [["1", "初级课件"], ["2", "中级课件"], ["3", "高级课件"]];
//难度范围
var classType = [["1", "内部课件(内对内)"], ["2", "外部课件(内对外)"], ["3", "外对内课件(外对内)"]];
//课件类型
var companyclienttype = [["0", "地产类"], ["1", "政府类"], ["2", "政府平台公司"], ["3", "其他类"]];
//集团客户类别
var companystatus = [["1", "开业"], ["2", "暂停"], ["3", "注销"]];
//公司状态
var yearcheck = [["1", "扫码"], ["2", "账号登录"], ["3", "联络员登录"]];
//年检方式
var seallocation = [["1", "公司总部持有"], ["2", "分公司自行持有"]];
//印章所在地
var sealclassification = [["1", "智能章"], ["2", "分子公司行政章"]];
//智能章/分子公司印章
var contributeType = [["1", "管理类"], ["2", "技术类"], ["3", "其他类"]];
//投稿类型
var interviewClassify = [["1", "转正面谈"], ["2", "常规面谈"], ["3", "离职面谈"], ["4", "其他"]];
//面谈分类
var combinestatus = [["1", "未结对"], ["2", "结对审批中"], ["3", "结对中"], ["4", "已谢师"]];
//结对状态
var learnform = [["1", "老师讲解+自学"], ["2", "实践"]];
//学习形式
var externalseal = [["1", "齐全"], ["2", "委托单位"], ["3", "建设单位"], ["4", "承包单位"], ["5", "咨询单位"], ["6", "其他"]];
//成果审批外部用印
var articleRank = [["1", "公司级"], ["2", "部门级"]];
//公文级别
var PublicationChannel = [["1", "系统平台发布"], ["2", "管理群企业邮箱/微信管理群"], ["3", "全员邮箱(QQ员工群/微信员工群)"], ["4", "对外发文"], ["5", "其它"]];
//发文渠道
var totalpriceTypes = [["1", "工程总承包清单及定额计价"], ["2", "工程总承包及自主报价"], ["3", "国标清单计量及定额计价"], ["4", "国标清单计量及自助报价"], ["5", "集采清单"], ["6", "市场清单"], ["7", "合同尚未签订"], ["8", "其他"]];
//总包计价方式
var certificate_status = [["1", "有效"], ["0", "无效"], ["3", "到期"]];
//证件状态
var tdcSumType = [["1", "学习课程内容的理解与总结提炼：意在考察学习与归纳能力"], ["2", "关联反思与实际应用：意在考察转化与创新能力"], ["3", "课程评价与自我评估：意在考察批判性思维与自我认知"]];
//课程评分类别
var tdcExamType = [["1", "全国注册一级造价师考试"], ["2", "全国注册一级建造师"], ["3", "咨询（投资）工程师"], ["4", "全国注册监理工程师"]];
//培训中心考试名称
var tdcCertifyType = [["1", "职称申报"], ["2", "职业考试"]];
//培训中心证件分类
var partyType = [["1", "流动党员"], ["2", "预备党员"], ["3", "党员"], ["4", "入党积极分子"]];
//党员类型
var resumelabel = [["1", "核心人才库"], ["2", "通用人才库"], ["3", "储备人才库"], ["4", "暂不考虑"]];
//简历标签
var highestdegreeway = [["1", "统招"], ["2", "全日制自考"], ["3", "成考(脱产)"], ["4", "校外自考"], ["5", "成考(业余)"], ["6", "成考(函授)"]];
//最高学历获得方式
var withoriginalunit = [["1", "在岗"], ["2", "离职办理中"], ["3", "已解除劳动关系"], ["4", "应届毕业生/实习生"], ["5", "停薪留职"]];
//与原单位关系
var buyerType = [["1", "企业"], ["2", "政府与事业单位"], ["3", "部队"], ["4", "个人"]];
//购买方类型
var wageSubsidyType = [["1", "造价类"], ["2", "全咨类"]];
//薪资证书补贴类型
var titleType = [["1", "高级职称"], ["2", "中级职称"], ["3", "初级职称/无职称"]];
//职称类别
var certificateType = [["1", "一级造价工程师"], ["2", "一级注册建造师"], ["3", "注册监理工程师"], ["4", "咨询工程师（投资）"], ["5", "注册安全工程师"]];
//薪资补贴证书类别
var wagesMajorType = [["0", "/"], ["1", "土建"], ["2", "交通"], ["3", "水利"], ["4", "安装"], ["5", "住建"]];
//薪资补贴证书类别

function getCodeGroupName(obj, val) {
    for (var i = 0; i < obj.length; i++) {
        if (obj[i][0] == val) {
            document.write(obj[i][1]);
            break;
        }
    }
}

function getCodeGroupOption(obj) {
    var newOptions = '';
    for (var i = 0; i < obj.length; i++) {
        newOptions += '<option value=' + obj[i][0] + '>' + obj[i][1] + '</option>';
    }
    document.write(newOptions);
}

function getCodeGroupOptionDefaultValue(obj, val) {
    var option = '';
    for (var i = 0; i < obj.length; i++) {
        if (obj[i][0] == val) {
            option += '<option value=' + obj[i][0] + ' selected>' + obj[i][1] + '</option>';
        } else {
            option += '<option value=' + obj[i][0] + '>' + obj[i][1] + '</option>';
        }
    }
    document.write(option);
}
